[
  {
    "title": "TeraLab to Host a Special Session on HPC and Genomics @ CIBB 2025",
    "date": "2025-09-09",
    "link": "https://www.bioinformatics.polimi.it/CIBB2025/#:~:text=HPCAIG",
    "img": "",
    "description": "<p style=\"margin-bottom: 10px;\">As part of the upcoming CIBB 2025 – Computational Intelligence Methods for Bioinformatics and Biostatistics conference, to be held in Milan from September 10–12, 2025, TeraLab will organize a Special Session entitled:</p><h2 style=\"margin-bottom: 10px;\"><strong>High-Performance Computing for AI-driven Genomics</strong></h2><p style=\"margin-bottom: 10px;\">The session will focus on the intersection of high-performance computing, deep learning, and large-scale genomic data analysis. Topics include:</p><ul><li>&middot; modeling and analysis of large genomic datasets</li><li>&middot; optimization of computational pipelines using HPC and GPU-based infrastructures</li><li>&middot; application of deep learning models to complex biological problems</li></ul><p style=\"margin-top: 10px;\">The session aims to foster discussion and collaboration among researchers working on advanced computational methods for genomics, with particular attention to scalability, efficiency, and innovation.</p>"
  },
  {
    "title": "21st Conference on Computational Intelligence Methods for Bioinformatics and Biostatistics @ La Sapienza",
    "date": "2026-09-02",
    "link": "https://cibb2026.teralab.ai",
    "img": "",
    "description": "<p>\n  We are pleased to announce that <strong>TeraLab</strong>, part of the \n  <em>Dipartimento di Scienze Statistiche - Università di Roma \"La Sapienza\"</em>, \n  will organize the <strong>21st Conference on Computational Intelligence Methods for Bioinformatics and Biostatistics</strong>.\n</p>\n\n<p>\n  The event will take place from <strong>September 2–4, 2026</strong>, at \n  <strong>Sapienza Università di Roma</strong>, bringing together leading researchers in \n  bioinformatics, biostatistics, artificial intelligence, computational biology, and \n  data-intensive life sciences.\n</p>\n\n<p>\n  <strong>CIBB 2026</strong> will offer a multidisciplinary platform for scientific exchange, \n  featuring keynote lectures, special sessions, and peer-reviewed contributions on innovative \n  computational methods applied to biological and medical data.\n</p>\n\n<p>\n  We look forward to hosting a vibrant community of scholars and fostering new collaborations at Sapienza.\n</p>\n"
  }
]




