[
  {
    "type": "PH, TDA, Image Analysis",
    "title": "PixHomology",
    "summary": "PixHomology is an open-source software for image processing and analysis focused on persistent homology computation. It provides a set of tools and algorithms to explore the topological features of 2D images, enabling users to extract meaningful information about the underlying structures.",
    "img": "images/research/pixhomology.png",
    "link": "https://riccardoc95.github.io/PixHomology/",
    "github": "https://github.com/riccardoc95/PixHomology"
  },
  {
    "type": "",
    "title": "Recovering reproducible and local signal in genomic data",
    "summary": "This research area focuses on designing and implementing machine learning algorithms capable of disentangling reproducible and region-specific signals from high-dimensional and noisy genomic datasets. Specifically, genomic datasets are often large, noisy, and heterogeneous, which makes it difficult to distinguish true biological signals from random variation. By using advanced machine learning tools, the project seeks to recover local (region-specific) signals that are consistent across different experiments or datasets, improving the reliability and interpretability of genomic analyses.",
    "img": "",
    "link": "https://biostatistics.sph.brown.edu/news/2023-01-23/devito-award",
    "github": ""
  },
  {
    "type": "",
    "title": "Statistical Methods for Cancer Mutational Signatures",
    "summary": "This research area focuses on the development of advanced statistical frameworks for the inference and interpretation of mutational signatures in cancer genomes. The goal is to improve the detection of complex mutational patterns and their association with specific mutagenic processes, enabling more accurate models of cancer evolution and molecular mechanisms. The work combines machine learning and dimensionality reduction techniques, such as non-negative matrix factorization, to extract reproducible and biologically meaningful signatures from high-dimensional genomic data.",
    "img": "",
    "link": "",
    "github": ""
  },
  {
    "type": "",
    "title": "Causal Inference for multivariate outcomes and multi-study analysis",
    "summary": "This research area focuses on developing statistical and machine learning methods for causal inference in the context of multivariate outcomes and multi-study data integration. The goal is to identify causal relationships that remain consistent across different studies or populations while accounting for complex dependencies among multiple outcomes. The work leverages modern approaches such as representation learning and dimensionality reduction to enhance the robustness and generalizability of causal effect estimation in high-dimensional settings.",
    "img": "",
    "link": "",
    "github": ""
  }
]