[
  {
    "keywords": "Persistent Homology, Topological Data Analysis, Image Topology",
    "title": "Topological Data Analysis of Images via Persistent Homology",
    "summary": "This research area focuses on the development and application of topological data analysis (TDA) techniques, specifically persistent homology, for the study of 2D images. By leveraging topological invariants, the goal is to extract robust and scale-invariant features that capture the underlying structure of image data. The approach enables a deeper understanding of shape, connectivity, and texture beyond traditional pixel-based methods.",
    "img": "images/research/pixhomology.png",
    "link": "https://riccardoc95.github.io/PixHomology/",
    "github": "https://github.com/riccardoc95/PixHomology"
  },
  {
    "keywords": "Computational Genomics, High-Performance Computing, Bioinformatics",
    "title": "High-Performance Computational Genomics",
    "summary": "This research area explores the intersection of large-scale genomics and high-performance computing (HPC), focusing on the design of scalable and efficient computational workflows. Core topics include distributed computing application for variant detection across both linear and pangenomic reference models, and the development of accelerated pipelines for long-read sequencing data, including error correction. By harnessing parallel architectures and optimized algorithms, the goal is to extend the limits of genomic data processing, enabling faster, deeper, and more comprehensive analyses at unprecedented scales.",
    "img": "images/research/blank.png",
    "link": "",
    "github": ""
  },
  {
    "keywords": "Computational Biology, , Genomic Data Representation, Deep Learning",
    "title": "Advanced Computational Methods for Genomics",
    "summary": "This research area focuses on the analysis of different genomic data representations (from sequences to graphs) using approaches that extend beyond traditional combinatorial algorithms. The goal is to improve the depth, accuracy, and scalability of genomic analyses, ranging from querying large-scale genomic databases embedded in learned latent spaces to developing novel assembly techniques that exploit the geometry of assembly graphs. This work combines innovative mathematical formulations of genomic problems with state-of-the-art deep learning models to advance both theory and practical applications in genomics.",
    "img": "",
    "link": "",
    "github": ""
  },
  {
    "keywords": "",
    "title": "Domain-Aware LLMs with RAG and Knowledge Graphs",
    "summary": "This research area explores the intersection of large language models (LLMs), knowledge engineering, and retrieval-augmented architectures, focusing on the specialization of LLMs for domain-specific tasks. Core topics include the construction of domain knowledge graphs and their integration into Knowledge-Augmented Generation (KAG) frameworks, the design of hybrid Retrieval-Augmented Generation (RAG) pipelines combining vector and graph-based retrieval, and the fine-tuning of LLMs on curated corpora. These techniques aim to enhance the domain awareness, factual grounding, and adaptability of generative systems across diverse application contexts.",
    "img": "",
    "link": "",
    "github": ""
  }
]